package org.javaacademy.homework.homework1.ex3;

import java.util.ArrayList;
import java.util.List;

public class RunnerEx3 {
    public static void start() {
        //Задание №3 Ресторанный гуру
        //Николай Петрович ходит по ресторанам. За 5 дней он был во множестве ресторанов.
        //Он обратился к вам, чтобы узнать в каком ресторане(ах) он был каждый день
        // (т.е. найти ресторан(ы) в которых он был и в понедельник, и во вторник, и в среду и тд).

        List<String> monday = List.of("Чебуречная №1", "Реберная", "Андерсон", "Ниппон", "Фо бо");
        List<String> tuesday = List.of("Вареничная №1", "Пушкин", "Чебуречная №1", "Ниппон", "Реберная");
        List<String> wednesday = List.of("Реберная", "Арарат", "Майя", "Ниппон", "Таксим");
        List<String> thursday = List.of("Грех", "Ваниль", "Реберная", "Пянсе", "Фо бо");
        List<String> friday = List.of("Бёрдс", "Реберная", "Андерсон", "Ниппон", "Чифанька");
        ArrayList<String> everyDay = new ArrayList<>(monday);
        ArrayList<List<String>> arrayListDays = new ArrayList<>(List.of(tuesday, wednesday, thursday, friday));
        for (List<String> list : arrayListDays) {
            everyDay.retainAll(list);
        }
        System.out.println(everyDay);
    }
}
